configXML/InformationRegisters/ДанныеРеспондентовКурсовОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеРеспондентовКурсовОбучения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОзнакомленияСТеорией</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполненияПрактическойЧасти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КурсОбучения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КурсыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Респондент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configXML/InformationRegisters/ДанныеРеспондентовКурсовОбучения/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает дату ознакомления респондента с теорией курса. Запись, в случае её отсутствия, создается.
//
// Параметры:
//  КурсОбучения - ДокументСсылка.КурсОбучения - документ, данные по которому актуализируются
//  Респондент - СправочникСсылка.Пользователи - респондент
//
Процедура УстановитьДатуОзнакомленияРеспондентаСКурсом(КурсОбучения, Респондент) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Запись = СоздатьМенеджерЗаписи();
	
	Запись.КурсОбучения = КурсОбучения;
	Запись.Респондент = Респондент;
	
	Запись.Прочитать();
	// Хотя работа c курсом и не предусматривает выполнение записи в таком порядке, в котором допускается 
	// его выполнение до ознакомления с ним, прочитаем, дабы по случайности не затереть дату выполнения курса.
	Если Запись.Выбран() Тогда
		Запись.ДатаОзнакомленияСТеорией = ТекущаяДата;
	Иначе
		Запись.КурсОбучения = КурсОбучения;
		Запись.Респондент = Респондент;
		ЗаполнитьЗначенияСвойств(Запись, ИнициализироватьСтруктуруДанныхПрохожденияКурса(ТекущаяДата));
	КонецЕсли;
	
	Запись.Записать(Истина);
	
КонецПроцедуры

// Устанавливает дату выполнения курса респондентом. Запись, в случае её отсутствия, создается.
// Если запись не содержит данных о дате ознакомления с теорией, дата устанавливается равной дате выполнения курса.
//
// Параметры:
//  КурсОбучения - ДокументСсылка.КурсОбучения - документ, данные по которому актуализируются
//  Респондент - СправочникСсылка.Пользователи - респондент
//
Процедура УстановитьДатуВыполненияКурсаРеспондентом(КурсОбучения, Респондент, Комментарий) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Запись = СоздатьМенеджерЗаписи();
	
	Запись.КурсОбучения = КурсОбучения;
	Запись.Респондент = Респондент;
	
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.ДатаВыполненияПрактическойЧасти = ТекущаяДата;
		Запись.Комментарий = Комментарий;
	Иначе
		Запись.КурсОбучения = КурсОбучения;
		Запись.Респондент = Респондент;
		// Если по какой-то причине выполнение происходит до ознакомления, дату ознакомления устанавливаем датой выполнения.
		ЗаполнитьЗначенияСвойств(Запись, ИнициализироватьСтруктуруДанныхПрохожденияКурса(ТекущаяДата, ТекущаяДата, Комментарий));
	КонецЕсли;
	
	Запись.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьДанныеПрохожденияКурсаРеспондентом(КурсОбучения, Респондент) Экспорт
	
	Результат = ИнициализироватьСтруктуруДанныхПрохожденияКурса();
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРеспондентовКурсовОбучения.ДатаОзнакомленияСТеорией КАК ДатаОзнакомленияСТеорией,
		|	ДанныеРеспондентовКурсовОбучения.ДатаВыполненияПрактическойЧасти КАК ДатаВыполненияПрактическойЧасти,
		|	ДанныеРеспондентовКурсовОбучения.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ДанныеРеспондентовКурсовОбучения КАК ДанныеРеспондентовКурсовОбучения
		|ГДЕ
		|	ДанныеРеспондентовКурсовОбучения.КурсОбучения = &КурсОбучения
		|	И ДанныеРеспондентовКурсовОбучения.Респондент = &Респондент";
	Запрос.УстановитьПараметр("КурсОбучения", КурсОбучения);
	Запрос.УстановитьПараметр("Респондент", Респондент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Удаляет строки регистра с данными по респонденту, если он более не входит в состав табличной части Обучающиеся.
//
// Параметры:
//  КурсОбучения - ДокументСсылка.КурсОбучения - документ, данные по которому актуализируются
//  Респонденты - Массив - актуальные значения колонки "Респондент" табличной части "Обучающиеся"
//
Процедура АктуализироватьДанныеРегистра(КурсОбучения, Респонденты) Экспорт

	Запрос = Новый Запрос();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеРеспондентовКурсовОбучения.КурсОбучения КАК КурсОбучения,
		|	ДанныеРеспондентовКурсовОбучения.Респондент КАК Респондент,
		|	ДанныеРеспондентовКурсовОбучения.ДатаОзнакомленияСТеорией КАК ДатаОзнакомленияСТеорией,
		|	ДанныеРеспондентовКурсовОбучения.ДатаВыполненияПрактическойЧасти КАК ДатаВыполненияПрактическойЧасти
		|ИЗ
		|	РегистрСведений.ДанныеРеспондентовКурсовОбучения КАК ДанныеРеспондентовКурсовОбучения
		|ГДЕ
		|	ДанныеРеспондентовКурсовОбучения.КурсОбучения = &КурсОбучения
		|	И НЕ ДанныеРеспондентовКурсовОбучения.Респондент В(&Респонденты)";
	
	Запрос.УстановитьПараметр("КурсОбучения", КурсОбучения);
	Запрос.УстановитьПараметр("Респонденты", Респонденты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КурсОбучения.Установить(КурсОбучения);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Удаление);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьСтруктуруДанныхПрохожденияКурса(ДатаОзнакомленияСТеорией = '00010101', 
														ДатаВыполненияПрактическойЧасти = '00010101', 
														Комментарий = "")
	Результат = Новый Структура("ДатаОзнакомленияСТеорией, ДатаВыполненияПрактическойЧасти, Комментарий", 
		ДатаОзнакомленияСТеорией, ДатаВыполненияПрактическойЧасти, Комментарий);
		
	Возврат Результат;
		
КонецФункции

#КонецОбласти
